# IsCanceled Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContext..::..IsCanceled Method
IExportContext Interface See Also
---
This method is queried at the beginning of every element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
bool IsCanceled()
```

Visual Basic
---
```text
Function IsCanceled As Boolean
```

Visual C++
---
```text
bool IsCanceled()
```

# ### Return Value
Return True if you wish to cancel the exporting process, or False otherwise.
# See Also
IExportContext Interface
Autodesk.Revit.DB Namespace